js216/stm32mp257_test_board/cubemx/mb.ioc
DDR_CTRL_PHY.UIS_SWIZZLE_21_REG=\#define DDR_UIS_SWIZZLE_21 0x00000001
DDR_CTRL_PHY.UIS_SWIZZLE_22_REG=\#define DDR_UIS_SWIZZLE_22 0x00000003
DDR_CTRL_PHY.UIS_SWIZZLE_23_REG=\#define DDR_UIS_SWIZZLE_23 0x00000002
DDR_CTRL_PHY.UIS_SWIZZLE_24_REG=\#define DDR_UIS_SWIZZLE_24 0x00000007
DDR_CTRL_PHY.UIS_SWIZZLE_25_REG=\#define DDR_UIS_SWIZZLE_25 0x00000004
DDR_CTRL_PHY.UIS_SWIZZLE_26_REG=\#define DDR_UIS_SWIZZLE_26 0x00000005
DDR_CTRL_PHY.UIS_SWIZZLE_27_REG=\#define DDR_UIS_SWIZZLE_27 0x00000006
DDR_CTRL_PHY.UIS_SWIZZLE_28_REG=\#define DDR_UIS_SWIZZLE_28 0x00000002
DDR_CTRL_PHY.UIS_SWIZZLE_29_REG=\#define DDR_UIS_SWIZZLE_29 0x00000003
DDR_CTRL_PHY.UIS_SWIZZLE_2_REG=\#define DDR_UIS_SWIZZLE_2 0x00000000
DDR_CTRL_PHY.UIS_SWIZZLE_30_REG=\#define DDR_UIS_SWIZZLE_30 0x00000001
DDR_CTRL_PHY.UIS_SWIZZLE_31_REG=\#define DDR_UIS_SWIZZLE_31 0x00000000
DDR_CTRL_PHY.UIS_SWIZZLE_32_REG=\#define DDR_UIS_SWIZZLE_32 0x00000000
DDR_CTRL_PHY.UIS_SWIZZLE_33_REG=\#define DDR_UIS_SWIZZLE_33 0x00000001
DDR_CTRL_PHY.UIS_SWIZZLE_34_REG=\#define DDR_UIS_SWIZZLE_34 0x00000002
DDR_CTRL_PHY.UIS_SWIZZLE_35_REG=\#define DDR_UIS_SWIZZLE_35 0x00000003
DDR_CTRL_PHY.UIS_SWIZZLE_36_REG=\#define DDR_UIS_SWIZZLE_36 0x00000004
DDR_CTRL_PHY.UIS_SWIZZLE_37_REG=\#define DDR_UIS_SWIZZLE_37 0x00000005
DDR_CTRL_PHY.UIS_SWIZZLE_38_REG=\#define DDR_UIS_SWIZZLE_38 0x00000000
DDR_CTRL_PHY.UIS_SWIZZLE_39_REG=\#define DDR_UIS_SWIZZLE_39 0x00000001
DDR_CTRL_PHY.UIS_SWIZZLE_3_REG=\#define DDR_UIS_SWIZZLE_3 0x00000001
DDR_CTRL_PHY.UIS_SWIZZLE_40_REG=\#define DDR_UIS_SWIZZLE_40 0x00000002
DDR_CTRL_PHY.UIS_SWIZZLE_41_REG=\#define DDR_UIS_SWIZZLE_41 0x00000003
DDR_CTRL_PHY.UIS_SWIZZLE_42_REG=\#define DDR_UIS_SWIZZLE_42 0x00000004
DDR_CTRL_PHY.UIS_SWIZZLE_43_REG=\#define DDR_UIS_SWIZZLE_43 0x00000005
DDR_CTRL_PHY.UIS_SWIZZLE_4_REG=\#define DDR_UIS_SWIZZLE_4 0x00000006
DDR_CTRL_PHY.UIS_SWIZZLE_5_REG=\#define DDR_UIS_SWIZZLE_5 0x00000007
DDR_CTRL_PHY.UIS_SWIZZLE_6_REG=\#define DDR_UIS_SWIZZLE_6 0x00000005
DDR_CTRL_PHY.UIS_SWIZZLE_7_REG=\#define DDR_UIS_SWIZZLE_7 0x00000004
DDR_CTRL_PHY.UIS_SWIZZLE_8_REG=\#define DDR_UIS_SWIZZLE_8 0x00000005
DDR_CTRL_PHY.UIS_SWIZZLE_9_REG=\#define DDR_UIS_SWIZZLE_9 0x00000004
DDR_CTRL_PHY.WDQSEXT=1
DDR_CTRL_PHY.WL=12
DDR_CTRL_PHY.ZQCTL0_REG=\#define DDR_ZQCTL0 0x02580012
DDR_CTRL_PHY.ZQCTL1_REG=\#define DDR_ZQCTL1 0x01e0493e
DDR_CTRL_PHY.ZQCTL2_REG=\#define DDR_ZQCTL2 0x00000000
DDR_CTRL_PHY.nRTP=10
DDR_CTRL_PHY.nWR=24
DDR_CTRL_PHY.tRFCab=130
DDR_CTRL_PHY.tRFCpb=60
DDR_CTRL_PHY.tXSR=137.5
DDR_CTRL_PHY.tpbR2pbR=60
ETH1.IPParameters=MediaInterface
ETH1.MediaInterface=HAL_ETH_RMII_MODE
FMC.IPParameters=NandBank1
FMC.NandBank1=FMC_NAND_BANK1
File.Version=6
GIC.ADC1_IRQn=true\:false\:High level
GIC.ETH1_PMT_IRQn=true\:false\:High level
GIC.ETH1_SBD_IRQn=true\:false\:High level
GIC.FMC_IRQn=true\:false\:High level
GIC.I2C1_IRQn=true\:false\:High level
GIC.I2C2_IRQn=true\:false\:High level
GIC.I2C4_IRQn=true\:false\:High level
GIC.I2C5_IRQn=true\:false\:High level
GIC.I2C6_IRQn=true\:false\:High level
GIC.I2C7_IRQn=true\:false\:High level
GIC.I2C8_IRQn=true\:false\:High level
GIC.RCC_IRQn=true\:false\:High level
GIC.RCC_WAKEUP_IRQn=true\:false\:High level
GIC.SDMMC1_IRQn=true\:false\:High level
GIC.SPI1_IRQn=true\:false\:High level
GIC.SPI2_IRQn=true\:false\:High level
GIC.SPI3_IRQn=true\:false\:High level
GIC.SPI4_IRQn=true\:false\:High level
GIC.SPI5_IRQn=true\:false\:High level
GIC.SPI6_IRQn=true\:false\:High level
GIC.SPI7_IRQn=true\:false\:High level
GIC.SPI8_IRQn=true\:false\:High level
GIC.UART4_IRQn=true\:false\:High level
GIC.UART5_IRQn=true\:false\:High level
GIC.UART7_IRQn=true\:false\:High level
GIC.UART8_IRQn=true\:false\:High level
GIC.UART9_IRQn=true\:false\:High level
GIC.USART1_IRQn=true\:false\:High level
GIC.USART2_IRQn=true\:false\:High level
GIC.USART3_IRQn=true\:false\:High level
GIC.USART6_IRQn=true\:false\:High level
GPIO.groupedBy=
JTCK-SWCLK.GPIOParameters=PinAttribute
JTCK-SWCLK.Mode=JTAG_5_pins
JTCK-SWCLK.PinAttribute=CortexA35NSOS
JTCK-SWCLK.Signal=DEBUG_JTCK-SWCLK
JTDI.GPIOParameters=PinAttribute
JTDI.Mode=JTAG_5_pins
JTDI.PinAttribute=CortexA35NSOS
JTDI.Signal=DEBUG_JTDI
JTDO-TRACESWO.GPIOParameters=PinAttribute
JTDO-TRACESWO.Mode=JTAG_5_pins
JTDO-TRACESWO.PinAttribute=CortexA35NSOS
JTDO-TRACESWO.Signal=DEBUG_JTDO-SWO
JTMS-SWDIO.GPIOParameters=PinAttribute
JTMS-SWDIO.Mode=JTAG_5_pins
JTMS-SWDIO.PinAttribute=CortexA35NSOS
JTMS-SWDIO.Signal=DEBUG_JTMS-SWDIO
KeepUserPlacement=false
LVDS1_D0N.GPIOParameters=PinAttribute
LVDS1_D0N.Mode=Single_Link
LVDS1_D0N.PinAttribute=CortexA35NSOS
LVDS1_D0N.Signal=LVDS1_D0N
LVDS1_D0P.GPIOParameters=PinAttribute
LVDS1_D0P.Mode=Single_Link
LVDS1_D0P.PinAttribute=CortexA35NSOS
LVDS1_D0P.Signal=LVDS1_D0P
LVDS1_D1N.GPIOParameters=PinAttribute
LVDS1_D1N.Mode=Single_Link
LVDS1_D1N.PinAttribute=CortexA35NSOS
LVDS1_D1N.Signal=LVDS1_D1N
LVDS1_D1P.GPIOParameters=PinAttribute
LVDS1_D1P.Mode=Single_Link
LVDS1_D1P.PinAttribute=CortexA35NSOS
LVDS1_D1P.Signal=LVDS1_D1P
LVDS1_D2N.Mode=Single_Link
LVDS1_D2N.Signal=LVDS1_D2N
LVDS1_D2P.GPIOParameters=PinAttribute
LVDS1_D2P.Mode=Single_Link
LVDS1_D2P.PinAttribute=CortexA35NSOS
LVDS1_D2P.Signal=LVDS1_D2P
LVDS1_D3N.GPIOParameters=PinAttribute
LVDS1_D3N.Mode=Single_Link
LVDS1_D3N.PinAttribute=CortexA35NSOS
LVDS1_D3N.Signal=LVDS1_D3N
LVDS1_D3P.GPIOParameters=PinAttribute
LVDS1_D3P.Mode=Single_Link
LVDS1_D3P.PinAttribute=CortexA35NSOS
LVDS1_D3P.Signal=LVDS1_D3P
LVDS1_D4N.GPIOParameters=PinAttribute
LVDS1_D4N.Mode=Single_Link
LVDS1_D4N.PinAttribute=CortexA35NSOS
LVDS1_D4N.Signal=LVDS1_D4N
LVDS1_D4P.GPIOParameters=PinAttribute
LVDS1_D4P.Mode=Single_Link
LVDS1_D4P.PinAttribute=CortexA35NSOS
LVDS1_D4P.Signal=LVDS1_D4P
Mcu.CPN=STM32MP257FAK3
Mcu.Context0=BootROMA35
Mcu.Context1=CortexA35SFSBLA
Mcu.Context2=CortexA35SSecureOS
Mcu.Context3=CortexA35NSSSBL
Mcu.Context4=CortexA35NSOS
Mcu.Context5=CortexM33NS
Mcu.ContextNb=6
Mcu.ContextProject=A35TD_TZDIS
Mcu.Family=STM32MP2
Mcu.IP0=ADC1
Mcu.IP1=BSEC
Mcu.IP10=I2C2
Mcu.IP11=I2C3
Mcu.IP12=I2C4
Mcu.IP13=I2C5
Mcu.IP14=I2C6
Mcu.IP15=I2C7
Mcu.IP16=I2C8
Mcu.IP17=LVDS
Mcu.IP18=NVIC2
Mcu.IP19=RCC
Mcu.IP2=CORTEX_M33
Mcu.IP20=RIF
Mcu.IP21=SDMMC1
Mcu.IP22=SPI1
Mcu.IP23=SPI2
Mcu.IP24=SPI3
Mcu.IP25=SPI4
Mcu.IP26=SPI5
Mcu.IP27=SPI6
Mcu.IP28=SPI7
Mcu.IP29=SPI8
Mcu.IP3=DDR_CTRL_PHY
Mcu.IP30=STGEN
Mcu.IP31=SYS
Mcu.IP32=UART4
Mcu.IP33=UART5
Mcu.IP34=UART7
Mcu.IP35=UART8
Mcu.IP36=UART9
Mcu.IP37=UCPD1
Mcu.IP38=USART1
Mcu.IP39=USART2
Mcu.IP4=DEBUG
Mcu.IP40=USART3
Mcu.IP41=USART6
Mcu.IP42=USB3DR
Mcu.IP43=USBH_HS
Mcu.IP5=ETH1
Mcu.IP6=FMC
Mcu.IP7=GIC
Mcu.IP8=GPU
Mcu.IP9=I2C1
Mcu.IPNb=44
Mcu.Name=STM32MP257FAKx
Mcu.Package=VFBGA424
Mcu.Pin0=PB2
Mcu.Pin1=PD11
Mcu.Pin10=PB4
Mcu.Pin100=JTMS-SWDIO
Mcu.Pin101=JTDI
Mcu.Pin102=PF11
Mcu.Pin103=PB15
Mcu.Pin104=PF8
Mcu.Pin105=PF1
Mcu.Pin106=PC2
Mcu.Pin107=PA15
Mcu.Pin108=PH11
Mcu.Pin109=PA10
Mcu.Pin11=PD0
Mcu.Pin110=PH7
Mcu.Pin111=PA5
Mcu.Pin112=PH3
Mcu.Pin113=USBH_HS_TXRTUNE
Mcu.Pin114=COMBOPHY_TX1P
Mcu.Pin115=NJTRST
Mcu.Pin116=PG0
Mcu.Pin117=PF4
Mcu.Pin118=PH12
Mcu.Pin119=PH10
Mcu.Pin12=PD5
Mcu.Pin120=PA9
Mcu.Pin121=USBH_HS_DP
Mcu.Pin122=USB3DR_DP
Mcu.Pin123=USB3DR_TXRTUNE
Mcu.Pin124=COMBOPHY_RX1N
Mcu.Pin125=COMBOPHY_REXT
Mcu.Pin126=PG2
Mcu.Pin127=PH13
Mcu.Pin128=PC1
Mcu.Pin129=PA4
Mcu.Pin13=PE0
Mcu.Pin130=USBH_HS_DM
Mcu.Pin131=USB3DR_DM
Mcu.Pin132=COMBOPHY_RX1P
Mcu.Pin133=VP_BSEC_VS_BSEC
Mcu.Pin134=VP_CORTEX_M33_VS_CORTEX_M33
Mcu.Pin135=VP_DDR_CTRL_PHY_LPDDR4
Mcu.Pin136=VP_DDR_CTRL_PHY_VS_32BITS
Mcu.Pin137=VP_DDR_CTRL_PHY_VS_2Gb
Mcu.Pin138=VP_GPU_VS_GPU
Mcu.Pin139=VP_RIF_VS_RIF1
Mcu.Pin14=PE4
Mcu.Pin140=VP_STGEN_VS_STGEN
Mcu.Pin141=VP_SYS_VS_Systick
Mcu.Pin15=PE7
Mcu.Pin16=PE11
Mcu.Pin17=PE14
Mcu.Pin18=PD12
Mcu.Pin19=PI11
Mcu.Pin2=PD6
Mcu.Pin20=PB7
Mcu.Pin21=PB1
Mcu.Pin22=PB6
Mcu.Pin23=PB5
Mcu.Pin24=PD9
Mcu.Pin25=PD10
Mcu.Pin26=PD4
Mcu.Pin27=PE1
Mcu.Pin28=PE2
Mcu.Pin29=PE3
Mcu.Pin3=PD1
Mcu.Pin30=PE5
Mcu.Pin31=PE8
Mcu.Pin32=PE13
Mcu.Pin33=PE12
Mcu.Pin34=PB14
Mcu.Pin35=PB8
Mcu.Pin36=PD2
Mcu.Pin37=PI10
Mcu.Pin38=PD7
Mcu.Pin39=PE15
Mcu.Pin4=PE6
Mcu.Pin40=PD13
Mcu.Pin41=PD15
Mcu.Pin42=PD14
Mcu.Pin43=LVDS1_D0P
Mcu.Pin44=LVDS1_D0N
Mcu.Pin45=PD3
Mcu.Pin46=LVDS1_D1P
Mcu.Pin47=LVDS1_D1N
Mcu.Pin48=LVDS1_D2P
Mcu.Pin49=LVDS1_D2N
Mcu.Pin5=PE9
Mcu.Pin50=PI6
Mcu.Pin51=PI7
Mcu.Pin52=LVDS1_D4P
Mcu.Pin53=LVDS1_D4N
Mcu.Pin54=PI5
Mcu.Pin55=PG15
Mcu.Pin56=LVDS1_D3P
Mcu.Pin57=LVDS1_D3N
Mcu.Pin58=PG8
Mcu.Pin59=PG9
Mcu.Pin6=PB13
Mcu.Pin60=PG10
Mcu.Pin61=PI1
Mcu.Pin62=PG14
Mcu.Pin63=PG11
Mcu.Pin64=PG12
Mcu.Pin65=PG13
Mcu.Pin66=PF13
Mcu.Pin67=PF14
Mcu.Pin68=PF12
Mcu.Pin69=PG5
Mcu.Pin7=PB10
Mcu.Pin70=PZ5
Mcu.Pin71=PG6
Mcu.Pin72=PZ0
Mcu.Pin73=PG7
Mcu.Pin74=PZ9
Mcu.Pin75=PZ1
Mcu.Pin76=PZ4
Mcu.Pin77=PZ6
Mcu.Pin78=JTCK-SWCLK
Mcu.Pin79=PG3
Mcu.Pin8=PB0
Mcu.Pin80=PF5
Mcu.Pin81=PH9
Mcu.Pin82=PF0
Mcu.Pin83=PA8
Mcu.Pin84=UCPD1_CC2
Mcu.Pin85=PF7
Mcu.Pin86=PC6
Mcu.Pin87=PA14
Mcu.Pin88=PC0
Mcu.Pin89=UCPD1_CC1
Mcu.Pin9=PB3
Mcu.Pin90=JTDO-TRACESWO
Mcu.Pin91=PC4
Mcu.Pin92=PA12
Mcu.Pin93=PH2
Mcu.Pin94=PA1
Mcu.Pin95=PG1
Mcu.Pin96=PA11
Mcu.Pin97=PA13
Mcu.Pin98=PA3
Mcu.Pin99=COMBOPHY_TX1N
Mcu.PinsNb=142
Mcu.ThirdPartyNb=0
Mcu.UserConstants=
Mcu.UserName=STM32MP257FAKx
MxCube.Version=6.17.0
MxDb.Version=DB.6.0.170
NJTRST.GPIOParameters=PinAttribute
NJTRST.Mode=JTAG_5_pins
NJTRST.PinAttribute=CortexA35NSOS
NJTRST.Signal=DEBUG_JTRST
NVIC2.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC2.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC2.ForceEnableDMAVector=true
NVIC2.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC2.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC2.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC2.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC2.PriorityGroup=NVIC_PRIORITYGROUP_4
NVIC2.RCC_WAKEUP_IRQn=true\:0\:0\:false\:false\:true\:false\:true\:true
NVIC2.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC2.SecureFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC2.SysTick_IRQn=true\:15\:0\:false\:false\:true\:false\:true\:false
NVIC2.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
PA1.GPIOParameters=PinAttribute
PA1.Mode=I2C
PA1.PinAttribute=CortexA35NSOS
PA1.Signal=I2C4_SDA
PA10.GPIOParameters=PinAttribute
PA10.Mode=Asynchronous
PA10.PinAttribute=CortexA35NSOS
PA10.Signal=USART2_RX
PA11.GPIOParameters=PinAttribute
PA11.Mode=RGMII (Reduced GMII)
PA11.PinAttribute=CortexA35NSOS
PA11.Signal=ETH1_RGMII_RX_CTL
PA12.GPIOParameters=PinAttribute
PA12.Mode=Full_Duplex_Master
PA12.PinAttribute=CortexA35NSOS
PA12.Signal=SPI6_MOSI
PA13.GPIOParameters=PinAttribute
PA13.Mode=RGMII (Reduced GMII)
PA13.PinAttribute=CortexA35NSOS
PA13.Signal=ETH1_RGMII_TX_CTL
PA14.GPIOParameters=PinAttribute
PA14.Mode=RGMII (Reduced GMII)
PA14.PinAttribute=CortexA35NSOS
PA14.Signal=ETH1_RGMII_RX_CLK
PA15.GPIOParameters=PinAttribute
PA15.Mode=RGMII (Reduced GMII)
PA15.PinAttribute=CortexA35NSOS
PA15.Signal=ETH1_RGMII_TXD0
PA3.GPIOParameters=PinAttribute
PA3.Mode=I2C
PA3.PinAttribute=CortexA35NSOS
PA3.Signal=I2C1_SCL
PA4.GPIOParameters=PinAttribute
PA4.Mode=Asynchronous
PA4.PinAttribute=CortexA35NSOS
PA4.Signal=USART2_TX
PA5.GPIOParameters=PinAttribute
PA5.Mode=CTS_RTS
PA5.PinAttribute=CortexA35NSOS
PA5.Signal=USART2_RTS
PA8.GPIOParameters=PinAttribute
PA8.Mode=I2C
PA8.PinAttribute=CortexA35NSOS
PA8.Signal=I2C5_SCL
PA9.GPIOParameters=PinAttribute
PA9.Mode=CTS_RTS
PA9.PinAttribute=CortexA35NSOS
PA9.Signal=USART2_CTS
PB0.GPIOParameters=PinAttribute
PB0.Mode=Full_Duplex_Master
PB0.PinAttribute=CortexA35NSOS
PB0.Signal=SPI2_SCK
PB1.GPIOParameters=PinAttribute
PB1.Mode=NSS_Signal_Hard_Output
PB1.PinAttribute=CortexA35NSOS
PB1.Signal=SPI3_NSS
PB10.GPIOParameters=PinAttribute
PB10.Mode=Full_Duplex_Master
PB10.PinAttribute=CortexA35NSOS
PB10.Signal=SPI3_MISO
PB13.GPIOParameters=PinAttribute
PB13.PinAttribute=
PB13.Signal=FMC_D5_DA5
PB14.GPIOParameters=PinAttribute
PB14.PinAttribute=
PB14.Signal=FMC_D7_DA7
PB15.GPIOParameters=PinAttribute
PB15.Mode=Full_Duplex_Master
PB15.PinAttribute=CortexA35NSOS
PB15.Signal=SPI5_SCK
PB2.GPIOParameters=PinAttribute
PB2.Mode=Full_Duplex_Master
PB2.PinAttribute=CortexA35NSOS
PB2.Signal=SPI2_MOSI
PB3.GPIOParameters=PinAttribute
PB3.Mode=NSS_Signal_Hard_Output
PB3.PinAttribute=CortexA35NSOS
PB3.Signal=SPI2_NSS
PB4.GPIOParameters=PinAttribute
PB4.Mode=I2C
PB4.PinAttribute=CortexA35NSOS
PB4.Signal=I2C2_SDA
PB5.GPIOParameters=PinAttribute
PB5.Mode=I2C
PB5.PinAttribute=CortexA35NSOS
PB5.Signal=I2C2_SCL
PB6.GPIOParameters=PinAttribute
PB6.Mode=Full_Duplex_Master
PB6.PinAttribute=CortexA35NSOS
PB6.Signal=SPI2_MISO
PB7.GPIOParameters=PinAttribute
PB7.Mode=Full_Duplex_Master
PB7.PinAttribute=CortexA35NSOS
PB7.Signal=SPI3_SCK
PB8.GPIOParameters=PinAttribute
PB8.Mode=Full_Duplex_Master
PB8.PinAttribute=CortexA35NSOS
PB8.Signal=SPI3_MOSI
PC0.GPIOParameters=PinAttribute
PC0.Mode=RGMII (Reduced GMII)
PC0.PinAttribute=CortexA35NSOS
PC0.Signal=ETH1_RGMII_GTX_CLK
PC1.GPIOParameters=PinAttribute
PC1.Mode=RGMII (Reduced GMII)
PC1.PinAttribute=CortexA35NSOS
PC1.Signal=ETH1_RGMII_TXD1
PC2.GPIOParameters=PinAttribute
PC2.Mode=RGMII (Reduced GMII)
PC2.PinAttribute=CortexA35NSOS
PC2.Signal=ETH1_RGMII_RXD1
PC4.GPIOParameters=PinAttribute
PC4.Mode=Full_Duplex_Master
PC4.PinAttribute=CortexA35NSOS
PC4.Signal=SPI6_MISO
PC6.GPIOParameters=PinAttribute
PC6.Mode=I2C
PC6.PinAttribute=CortexA35NSOS
PC6.Signal=I2C4_SCL
PD0.GPIOParameters=PinAttribute
PD0.Mode=Asynchronous
PD0.PinAttribute=CortexA35NSOS
PD0.Signal=UART7_RX
PD1.GPIOParameters=PinAttribute
PD1.Mode=Full_Duplex_Master
PD1.PinAttribute=CortexA35NSOS
PD1.Signal=SPI1_MISO
PD10.GPIOParameters=PinAttribute
PD10.Mode=Asynchronous
PD10.PinAttribute=CortexA35NSOS
PD10.Signal=UART4_RX
PD11.GPIOParameters=PinAttribute
PD11.Mode=Asynchronous
PD11.PinAttribute=CortexA35NSOS
PD11.Signal=UART4_TX
PD12.GPIOParameters=PinAttribute
PD12.PinAttribute=
PD12.Signal=FMC_D6_DA6
PD13.GPIOParameters=PinAttribute
PD13.PinAttribute=
PD13.Signal=FMC_NWE
PD14.GPIOParameters=PinAttribute
PD14.PinAttribute=
PD14.Signal=FMC_D4_DA4
PD15.GPIOParameters=PinAttribute
PD15.PinAttribute=
PD15.Signal=FMC_D3_DA3
PD2.GPIOParameters=PinAttribute
PD2.Mode=NSS_Signal_Hard_Output
PD2.PinAttribute=CortexA35NSOS
PD2.Signal=SPI1_NSS
PD3.GPIOParameters=PinAttribute
PD3.Mode=Asynchronous
PD3.PinAttribute=CortexA35NSOS
PD3.Signal=UART7_TX
PD4.GPIOParameters=PinAttribute
PD4.Mode=Full_Duplex_Master
PD4.PinAttribute=CortexA35NSOS
PD4.Signal=SPI4_MISO
PD5.GPIOParameters=PinAttribute
PD5.Mode=NSS_Signal_Hard_Output
PD5.PinAttribute=CortexA35NSOS
PD5.Signal=SPI4_NSS
PD6.GPIOParameters=PinAttribute
PD6.Mode=Full_Duplex_Master
PD6.PinAttribute=CortexA35NSOS
PD6.Signal=SPI4_MOSI
PD7.GPIOParameters=PinAttribute
PD7.Mode=Full_Duplex_Master
PD7.PinAttribute=CortexA35NSOS
PD7.Signal=SPI4_SCK
PD9.GPIOParameters=PinAttribute
PD9.Mode=Full_Duplex_Master
PD9.PinAttribute=CortexA35NSOS
PD9.Signal=SPI1_MOSI
PE0.GPIOParameters=PinAttribute
PE0.Mode=SD_4_bits_Wide_bus
PE0.PinAttribute=CortexA35NSOS
PE0.Signal=SDMMC1_D2
PE1.GPIOParameters=PinAttribute
PE1.Mode=SD_4_bits_Wide_bus
PE1.PinAttribute=CortexA35NSOS
PE1.Signal=SDMMC1_D3
PE11.GPIOParameters=PinAttribute
PE11.PinAttribute=
PE11.Signal=FMC_A16_CLE
PE12.GPIOParameters=PinAttribute
PE12.Mode=NandChipSelect1_1
PE12.PinAttribute=
PE12.Signal=FMC_NCE1
PE13.GPIOParameters=PinAttribute
PE13.Mode=Wait1
PE13.PinAttribute=
PE13.Signal=FMC_RNB
PE14.GPIOParameters=PinAttribute
PE14.Mode=NSS_Signal_Hard_Output
PE14.PinAttribute=CortexA35NSOS
PE14.Signal=SPI7_NSS
PE15.GPIOParameters=PinAttribute
PE15.PinAttribute=
PE15.Signal=FMC_NOE
PE2.GPIOParameters=PinAttribute
PE2.Mode=SD_4_bits_Wide_bus
PE2.PinAttribute=CortexA35NSOS
PE2.Signal=SDMMC1_CMD
PE3.GPIOParameters=PinAttribute
PE3.Mode=SD_4_bits_Wide_bus
PE3.PinAttribute=CortexA35NSOS
PE3.Signal=SDMMC1_CK
PE4.GPIOParameters=PinAttribute
PE4.Mode=SD_4_bits_Wide_bus
PE4.PinAttribute=CortexA35NSOS
PE4.Signal=SDMMC1_D0
PE5.GPIOParameters=PinAttribute
PE5.Mode=SD_4_bits_Wide_bus
PE5.PinAttribute=CortexA35NSOS
PE5.Signal=SDMMC1_D1
PE6.GPIOParameters=PinAttribute
PE6.PinAttribute=
PE6.Signal=FMC_D1_DA1
PE7.GPIOParameters=PinAttribute
PE7.PinAttribute=
PE7.Signal=FMC_D2_DA2
PE8.GPIOParameters=PinAttribute
PE8.PinAttribute=
PE8.Signal=FMC_A17_ALE
PE9.GPIOParameters=PinAttribute
PE9.PinAttribute=
PE9.Signal=FMC_D0_DA0
PF0.GPIOParameters=PinAttribute
PF0.Mode=RGMII (Reduced GMII)
PF0.PinAttribute=CortexA35NSOS
PF0.Signal=ETH1_MDC
PF1.GPIOParameters=PinAttribute
PF1.Mode=RGMII (Reduced GMII)
PF1.PinAttribute=CortexA35NSOS
PF1.Signal=ETH1_RGMII_RXD0
PF11.GPIOParameters=PinAttribute
PF11.Mode=Asynchronous
PF11.PinAttribute=CortexA35NSOS
PF11.Signal=UART8_RX
PF12.GPIOParameters=PinAttribute
PF12.Mode=Full_Duplex_Master
PF12.PinAttribute=CortexA35NSOS
PF12.Signal=SPI5_MISO
PF13.GPIOParameters=PinAttribute
PF13.Mode=Asynchronous
PF13.PinAttribute=CortexA35NSOS
PF13.Signal=USART6_TX
PF14.GPIOParameters=PinAttribute
PF14.Mode=Asynchronous
PF14.PinAttribute=CortexA35NSOS
PF14.Signal=USART6_RX
PF4.GPIOParameters=PinAttribute
PF4.Mode=NSS_Signal_Hard_Output
PF4.PinAttribute=CortexA35NSOS
PF4.Signal=SPI6_NSS
PF5.GPIOParameters=PinAttribute
PF5.Mode=RGMII (Reduced GMII)
PF5.PinAttribute=CortexA35NSOS
PF5.Signal=ETH1_MDIO
PF7.GPIOParameters=PinAttribute
PF7.Mode=Full_Duplex_Master
PF7.PinAttribute=CortexA35NSOS
PF7.Signal=SPI6_SCK
