js216/stm32mp257_test_board/cubemx/mb.ioc
PF8.GPIOParameters=PinAttribute
PF8.Mode=ETH Clock Output (PHY without Quartz)
PF8.PinAttribute=CortexA35NSOS
PF8.Signal=ETH1_CLK
PG0.GPIOParameters=PinAttribute
PG0.Mode=I2C
PG0.PinAttribute=CortexA35NSOS
PG0.Signal=I2C3_SDA
PG1.GPIOParameters=PinAttribute
PG1.Mode=I2C
PG1.PinAttribute=CortexA35NSOS
PG1.Signal=I2C3_SCL
PG10.GPIOParameters=PinAttribute
PG10.Mode=Asynchronous
PG10.PinAttribute=CortexA35NSOS
PG10.Signal=UART5_RX
PG11.GPIOParameters=PinAttribute
PG11.Mode=Full_Duplex_Master
PG11.PinAttribute=CortexA35NSOS
PG11.Signal=SPI7_MOSI
PG12.GPIOParameters=PinAttribute
PG12.Mode=Full_Duplex_Master
PG12.PinAttribute=CortexA35NSOS
PG12.Signal=SPI7_MISO
PG13.GPIOParameters=PinAttribute
PG13.Mode=Full_Duplex_Master
PG13.PinAttribute=CortexA35NSOS
PG13.Signal=SPI7_SCK
PG14.GPIOParameters=PinAttribute
PG14.Mode=Asynchronous
PG14.PinAttribute=CortexA35NSOS
PG14.Signal=USART1_TX
PG15.GPIOParameters=PinAttribute
PG15.Mode=Asynchronous
PG15.PinAttribute=CortexA35NSOS
PG15.Signal=USART1_RX
PG2.GPIOParameters=PinAttribute
PG2.Mode=IN2-Single-Ended
PG2.PinAttribute=CortexA35NSOS
PG2.Signal=ADC1_INP2
PG3.GPIOParameters=PinAttribute
PG3.Mode=Full_Duplex_Master
PG3.PinAttribute=CortexA35NSOS
PG3.Signal=SPI5_MOSI
PG5.GPIOParameters=PinAttribute
PG5.Mode=I2C
PG5.PinAttribute=CortexA35NSOS
PG5.Signal=I2C6_SDA
PG6.GPIOParameters=PinAttribute
PG6.Mode=I2C
PG6.PinAttribute=CortexA35NSOS
PG6.Signal=I2C6_SCL
PG7.GPIOParameters=PinAttribute
PG7.Mode=NSS_Signal_Hard_Output
PG7.PinAttribute=CortexA35NSOS
PG7.Signal=SPI5_NSS
PG8.GPIOParameters=PinAttribute
PG8.Mode=Asynchronous
PG8.PinAttribute=CortexA35NSOS
PG8.Signal=UART9_TX
PG9.GPIOParameters=PinAttribute
PG9.Mode=Asynchronous
PG9.PinAttribute=CortexA35NSOS
PG9.Signal=UART5_TX
PH10.GPIOParameters=PinAttribute
PH10.Mode=RGMII (Reduced GMII)
PH10.PinAttribute=CortexA35NSOS
PH10.Signal=ETH1_RGMII_TXD2
PH11.GPIOParameters=PinAttribute
PH11.Mode=RGMII (Reduced GMII)
PH11.PinAttribute=CortexA35NSOS
PH11.Signal=ETH1_RGMII_TXD3
PH12.GPIOParameters=PinAttribute
PH12.Mode=RGMII (Reduced GMII)
PH12.PinAttribute=CortexA35NSOS
PH12.Signal=ETH1_RGMII_RXD2
PH13.GPIOParameters=PinAttribute
PH13.Mode=RGMII (Reduced GMII)
PH13.PinAttribute=CortexA35NSOS
PH13.Signal=ETH1_RGMII_RXD3
PH2.GPIOParameters=PinAttribute
PH2.Mode=I2C
PH2.PinAttribute=CortexA35NSOS
PH2.Signal=I2C5_SDA
PH3.GPIOParameters=PinAttribute
PH3.Mode=I2C
PH3.PinAttribute=CortexA35NSOS
PH3.Signal=I2C7_SCL
PH7.GPIOParameters=PinAttribute
PH7.Mode=I2C
PH7.PinAttribute=CortexA35NSOS
PH7.Signal=I2C7_SDA
PH9.GPIOParameters=PinAttribute
PH9.Mode=ETH 125MHz Clock Input
PH9.PinAttribute=CortexA35NSOS
PH9.Signal=ETH1_RGMII_CLK125
PI1.GPIOParameters=PinAttribute
PI1.Mode=I2C
PI1.PinAttribute=CortexA35NSOS
PI1.Signal=I2C1_SDA
PI10.GPIOParameters=PinAttribute
PI10.Mode=Full_Duplex_Master
PI10.PinAttribute=CortexA35NSOS
PI10.Signal=SPI1_SCK
PI11.GPIOParameters=PinAttribute
PI11.Mode=Asynchronous
PI11.PinAttribute=CortexA35NSOS
PI11.Signal=UART8_TX
PI5.GPIOParameters=PinAttribute
PI5.Mode=Asynchronous
PI5.PinAttribute=CortexA35NSOS
PI5.Signal=UART9_RX
PI6.GPIOParameters=PinAttribute
PI6.Mode=Asynchronous
PI6.PinAttribute=CortexA35NSOS
PI6.Signal=USART3_TX
PI7.GPIOParameters=PinAttribute
PI7.Mode=Asynchronous
PI7.PinAttribute=CortexA35NSOS
PI7.Signal=USART3_RX
PZ0.GPIOParameters=PinAttribute
PZ0.Mode=Full_Duplex_Master
PZ0.PinAttribute=CortexA35NSOS
PZ0.Signal=SPI8_MOSI
PZ1.GPIOParameters=PinAttribute
PZ1.Mode=Full_Duplex_Master
PZ1.PinAttribute=CortexA35NSOS
PZ1.Signal=SPI8_MISO
PZ4.GPIOParameters=PinAttribute
PZ4.Mode=I2C
PZ4.PinAttribute=CortexA35NSOS
PZ4.Signal=I2C8_SCL
PZ5.GPIOParameters=PinAttribute
PZ5.Mode=Full_Duplex_Master
PZ5.PinAttribute=CortexA35NSOS
PZ5.Signal=SPI8_SCK
PZ6.GPIOParameters=PinAttribute
PZ6.Mode=NSS_Signal_Hard_Output
PZ6.PinAttribute=CortexA35NSOS
PZ6.Signal=SPI8_NSS
PZ9.GPIOParameters=PinAttribute
PZ9.Mode=I2C
PZ9.PinAttribute=CortexA35NSOS
PZ9.Signal=I2C8_SDA
PinOutPanel.CurrentBGAView=Top
PinOutPanel.RotationAngle=0
ProjectManager.AskForMigrate=true
ProjectManager.BackupPrevious=false
ProjectManager.CompilerLinker=GCC
ProjectManager.CompilerOptimize=6
ProjectManager.ComputerToolchain=false
ProjectManager.CoupleFile=false
ProjectManager.CustomerFirmwarePackage=
ProjectManager.DefaultFWLocation=true
ProjectManager.DeletePrevious=true
ProjectManager.DeviceId=STM32MP257FAKx
ProjectManager.DeviceTreeLocation=C\:\\Users\\Jkastelic\\Documents\\projects\\SR790\\testing\\stm32mp257_test_board\\cubemx\\CA35\\DeviceTree\\
ProjectManager.DeviceTreeLocationCortexM=
ProjectManager.FirmwarePackage=STM32Cube FW_MP2 V1.3.0
ProjectManager.FreePins=false
ProjectManager.FreePinsContext=
ProjectManager.HalAssertFull=false
ProjectManager.HeapSize=0x200
ProjectManager.KeepUserCode=true
ProjectManager.LastFirmware=true
ProjectManager.LibraryCopy=1
ProjectManager.MainLocation=Core/Src
ProjectManager.NoMain=false
ProjectManager.PreviousToolchain=
ProjectManager.ProjectBuild=false
ProjectManager.ProjectFileName=mb.ioc
ProjectManager.ProjectName=mb
ProjectManager.ProjectStructure=
ProjectManager.RegisterCallBack=
ProjectManager.StackSize=0x400
ProjectManager.TargetToolchain=STM32CubeIDE
ProjectManager.ToolChainLocation=
ProjectManager.UAScriptAfterPath=
ProjectManager.UAScriptBeforePath=
ProjectManager.UnderRoot=true
ProjectManager.functionlistsort=1-SystemClock_Config-RCC-false-HAL-false
RCC.ADC12Freq_Value=64000000
RCC.ADC3Freq_Value=1600000000
RCC.AHB1234Freq_Value=64000000
RCC.APB1Freq_Value=64000000
RCC.APB2Freq_Value=64000000
RCC.APB3Freq_Value=64000000
RCC.APB4Freq_Value=64000000
RCC.APBDBGFreq_Value=64000000
RCC.D3PERFreq_Value=16000000
RCC.DSIBLANEFreq_Value=1600000000
RCC.DSIPHYFreq_Value=1600000000
RCC.DTSFreq_Value=16000000
RCC.FOUTPOSTDIV1Freq_Value=1600000000
RCC.FOUTPOSTDIV2Freq_Value=1600000000
RCC.FOUTPOSTDIV3Freq_Value=1600000000
RCC.FOUTPOSTDIV4Freq_Value=1600000000
RCC.FOUTPOSTDIV5Freq_Value=1600000000
RCC.FOUTPOSTDIV6Freq_Value=1600000000
RCC.FOUTPOSTDIV7Freq_Value=1600000000
RCC.FOUTPOSTDIV8Freq_Value=1600000000
RCC.FamilyName=M
RCC.HSE_VALUE=40000000
RCC.HSI_VALUE=64000000
RCC.IPParameters=ADC12Freq_Value,ADC3Freq_Value,AHB1234Freq_Value,APB1Freq_Value,APB2Freq_Value,APB3Freq_Value,APB4Freq_Value,APBDBGFreq_Value,D3PERFreq_Value,DSIBLANEFreq_Value,DSIPHYFreq_Value,DTSFreq_Value,FOUTPOSTDIV1Freq_Value,FOUTPOSTDIV2Freq_Value,FOUTPOSTDIV3Freq_Value,FOUTPOSTDIV4Freq_Value,FOUTPOSTDIV5Freq_Value,FOUTPOSTDIV6Freq_Value,FOUTPOSTDIV7Freq_Value,FOUTPOSTDIV8Freq_Value,FamilyName,HSE_VALUE,HSI_VALUE,LSE_VALUE,LSI_VALUE,LVDSFreq_Value,MCO1PinFreq_Value,MCO2PinFreq_Value,MCUCLKFreq_VALUE,MCUClockFreq_Value,MCUDIVCLKFreq_Value,MSI_VALUE,Obs0Freq_Value,Obs1Freq_Value,ROOT0Freq_VALUE,ROOT10Freq_VALUE,ROOT11Freq_VALUE,ROOT12Freq_VALUE,ROOT13Freq_VALUE,ROOT14Freq_VALUE,ROOT15Freq_VALUE,ROOT16Freq_VALUE,ROOT17Freq_VALUE,ROOT18Freq_VALUE,ROOT19Freq_VALUE,ROOT1Freq_VALUE,ROOT20Freq_VALUE,ROOT21Freq_VALUE,ROOT22Freq_VALUE,ROOT23Freq_VALUE,ROOT24Freq_VALUE,ROOT25Freq_VALUE,ROOT26Freq_VALUE,ROOT27Freq_VALUE,ROOT28Freq_VALUE,ROOT29Freq_VALUE,ROOT2Freq_VALUE,ROOT30Freq_VALUE,ROOT31Freq_VALUE,ROOT32Freq_VALUE,ROOT34Freq_VALUE,ROOT36Freq_VALUE,ROOT37Freq_VALUE,ROOT38Freq_VALUE,ROOT39Freq_VALUE,ROOT3Freq_VALUE,ROOT40Freq_VALUE,ROOT41Freq_VALUE,ROOT42Freq_VALUE,ROOT44Freq_VALUE,ROOT45Freq_VALUE,ROOT46Freq_VALUE,ROOT47Freq_VALUE,ROOT48Freq_VALUE,ROOT49Freq_VALUE,ROOT4Freq_VALUE,ROOT50Freq_VALUE,ROOT51Freq_VALUE,ROOT52Freq_VALUE,ROOT53Freq_VALUE,ROOT54Freq_VALUE,ROOT55Freq_VALUE,ROOT56Freq_VALUE,ROOT57Freq_VALUE,ROOT58Freq_VALUE,ROOT59Freq_VALUE,ROOT5Freq_VALUE,ROOT60Freq_VALUE,ROOT61Freq_VALUE,ROOT62Freq_VALUE,ROOT63Freq_VALUE,ROOT6Freq_VALUE,ROOT7Freq_VALUE,ROOT8Freq_VALUE,ROOT9Freq_VALUE,RTCCLockSelection,RTCFreq_Value,Tim1OutputFreq_Value,Tim2OutputFreq_Value,USB2PHY1Freq_Value,USB2PHY2Freq_Value,USB3PCIPHYFreq_Value,VCO1OutputFreq_Value,VCO2OutputFreq_Value,VCO3OutputFreq_Value,VCO4OutputFreq_Value,VCO5OutputFreq_Value,VCO6OutputFreq_Value,VCO7OutputFreq_Value,VCO8OutputFreq_Value,VCOInput1Freq_Value,VCOInput2Freq_Value,VCOInput3Freq_Value,VCOInput4Freq_Value,VCOInput5Freq_Value,VCOInput6Freq_Value,VCOInput7Freq_Value,VCOInput8Freq_Value
RCC.LSE_VALUE=32768
RCC.LSI_VALUE=32000
RCC.LVDSFreq_Value=1600000000
RCC.MCO1PinFreq_Value=64000000
RCC.MCO2PinFreq_Value=64000000
RCC.MCUCLKFreq_VALUE=64000000
RCC.MCUClockFreq_Value=64000000
RCC.MCUDIVCLKFreq_Value=64000000
RCC.MSI_VALUE=16000000
RCC.Obs0Freq_Value=16000000
RCC.Obs1Freq_Value=16000000
RCC.ROOT0Freq_VALUE=64000000
RCC.ROOT10Freq_VALUE=64000000
RCC.ROOT11Freq_VALUE=64000000
RCC.ROOT12Freq_VALUE=64000000
RCC.ROOT13Freq_VALUE=64000000
RCC.ROOT14Freq_VALUE=64000000
RCC.ROOT15Freq_VALUE=64000000
RCC.ROOT16Freq_VALUE=64000000
RCC.ROOT17Freq_VALUE=64000000
RCC.ROOT18Freq_VALUE=64000000
RCC.ROOT19Freq_VALUE=64000000
RCC.ROOT1Freq_VALUE=64000000
RCC.ROOT20Freq_VALUE=64000000
RCC.ROOT21Freq_VALUE=64000000
RCC.ROOT22Freq_VALUE=64000000
RCC.ROOT23Freq_VALUE=64000000
RCC.ROOT24Freq_VALUE=64000000
RCC.ROOT25Freq_VALUE=64000000
RCC.ROOT26Freq_VALUE=1600000000
RCC.ROOT27Freq_VALUE=1600000000
RCC.ROOT28Freq_VALUE=1600000000
RCC.ROOT29Freq_VALUE=1600000000
RCC.ROOT2Freq_VALUE=64000000
RCC.ROOT30Freq_VALUE=1600000000
RCC.ROOT31Freq_VALUE=1600000000
RCC.ROOT32Freq_VALUE=1600000000
RCC.ROOT34Freq_VALUE=1600000000
RCC.ROOT36Freq_VALUE=16000000
RCC.ROOT37Freq_VALUE=64000000
RCC.ROOT38Freq_VALUE=64000000
RCC.ROOT39Freq_VALUE=64000000
RCC.ROOT3Freq_VALUE=64000000
RCC.ROOT40Freq_VALUE=32000
RCC.ROOT41Freq_VALUE=32000
RCC.ROOT42Freq_VALUE=64000000
RCC.ROOT44Freq_VALUE=64000000
RCC.ROOT45Freq_VALUE=64000000
RCC.ROOT46Freq_VALUE=64000000
RCC.ROOT47Freq_VALUE=1600000000
RCC.ROOT48Freq_VALUE=1600000000
RCC.ROOT49Freq_VALUE=1600000000
RCC.ROOT4Freq_VALUE=64000000
RCC.ROOT50Freq_VALUE=1600000000
RCC.ROOT51Freq_VALUE=64000000
RCC.ROOT52Freq_VALUE=64000000
RCC.ROOT53Freq_VALUE=64000000
RCC.ROOT54Freq_VALUE=1600000000
RCC.ROOT55Freq_VALUE=1600000000
RCC.ROOT56Freq_VALUE=64000000
RCC.ROOT57Freq_VALUE=1600000000
RCC.ROOT58Freq_VALUE=1600000000
RCC.ROOT59Freq_VALUE=1600000000
RCC.ROOT5Freq_VALUE=64000000
RCC.ROOT60Freq_VALUE=1600000000
RCC.ROOT61Freq_VALUE=64000000
RCC.ROOT62Freq_VALUE=64000000
RCC.ROOT63Freq_VALUE=64000000
RCC.ROOT6Freq_VALUE=64000000
RCC.ROOT7Freq_VALUE=32000
RCC.ROOT8Freq_VALUE=64000000
RCC.ROOT9Freq_VALUE=64000000
RCC.RTCCLockSelection=RCC_RTCCLKSOURCE_LSI
RCC.RTCFreq_Value=32000
RCC.Tim1OutputFreq_Value=64000000
RCC.Tim2OutputFreq_Value=64000000
RCC.USB2PHY1Freq_Value=1600000000
RCC.USB2PHY2Freq_Value=1600000000
RCC.USB3PCIPHYFreq_Value=1600000000
RCC.VCO1OutputFreq_Value=1600000000
RCC.VCO2OutputFreq_Value=1600000000
RCC.VCO3OutputFreq_Value=1600000000
RCC.VCO4OutputFreq_Value=1600000000
RCC.VCO5OutputFreq_Value=1600000000
RCC.VCO6OutputFreq_Value=1600000000
RCC.VCO7OutputFreq_Value=1600000000
RCC.VCO8OutputFreq_Value=1600000000
RCC.VCOInput1Freq_Value=64000000
RCC.VCOInput2Freq_Value=64000000
RCC.VCOInput3Freq_Value=64000000
RCC.VCOInput4Freq_Value=64000000
RCC.VCOInput5Freq_Value=64000000
RCC.VCOInput6Freq_Value=64000000
RCC.VCOInput7Freq_Value=64000000
RCC.VCOInput8Freq_Value=64000000
RIF.-0=ETR_CID_RIMU
RIF.-1=SDMMC1_CID_RIMU
RIF.-10=DCMIPP_CID_RIMU
RIF.-14=VDEC_CID_RIMU
RIF.-15=VENC_CID_RIMU
RIF.-2=SDMMC2_CID_RIMU
RIF.-3=SDMMC3_CID_RIMU
RIF.-4=USB3DR_CID_RIMU
RIF.-5=USBH_CID_RIMU
RIF.-6=ETH1_CID_RIMU
RIF.-7=ETH2_CID_RIMU
RIF.-8=PCIE_CID_RIMU
RIF.-9=GPU_CID_RIMU
RIF.ETH1_CID_RIMU=1
RIF.GPU_CID_RIMU=1
RIF.IPParameters=-0,-1,-2,-3,-4,-5,-6,-7,-8,-9,-10,-14,-15,USB3DR_CID_RIMU,USBH_CID_RIMU,ETH1_CID_RIMU,SDMMC1_CID_RIMU,GPU_CID_RIMU
RIF.RIFAWARE.DSIHOST\ Feature\ DSI_CMN\ Cid=1
RIF.RIFAWARE.DSIHOST\ Feature\ DSI_CMN\ CortexA35NSOS=true
RIF.RIFAWARE.DSIHOST\ Feature\ DSI_CMN\ CortexA35NSSSBL=true
RIF.RIFAWARE.DSIHOST\ Feature\ DSI_CMN\ Secure=false
RIF.RIFAWARE.DSIHOST\ Feature\ DSI_RDFIFO\ Cid=1
RIF.RIFAWARE.DSIHOST\ Feature\ DSI_RDFIFO\ CortexA35NSOS=true
RIF.RIFAWARE.DSIHOST\ Feature\ DSI_RDFIFO\ CortexA35NSSSBL=true
RIF.RIFAWARE.DSIHOST\ Feature\ DSI_RDFIFO\ Secure=false
RIF.RIFAWARE.DSIHOST\ Feature\ DSI_TRIG\ Cid=1
RIF.RIFAWARE.DSIHOST\ Feature\ DSI_TRIG\ CortexA35NSOS=true
RIF.RIFAWARE.DSIHOST\ Feature\ DSI_TRIG\ CortexA35NSSSBL=true
RIF.RIFAWARE.DSIHOST\ Feature\ DSI_TRIG\ Secure=false
RIF.RIFAWARE.ETHSW\ Feature\ ETHSW_ACM_CFG\ Cid=-
RIF.RIFAWARE.ETHSW\ Feature\ ETHSW_ACM_CFG\ Secure=false
RIF.RIFAWARE.ETHSW\ Feature\ ETHSW_ACM_MSGBUF\ Cid=-
RIF.RIFAWARE.ETHSW\ Feature\ ETHSW_ACM_MSGBUF\ Secure=false
RIF.RIFAWARE.ETHSW\ Feature\ ETHSW_DEIP\ Cid=-
RIF.RIFAWARE.ETHSW\ Feature\ ETHSW_DEIP\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ COMBOPHY\ Cid=1
RIF.RIFAWARE.EXTI1\ Feature\ COMBOPHY\ CortexA35NSOS=true
RIF.RIFAWARE.EXTI1\ Feature\ COMBOPHY\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ CPU1\ SEV\ interrupt\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ CPU2\ SEV\ interrupt\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ CPU2\ SYSRESETREQ\ local\ CPU2\ reset\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ DTS\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ DTS\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ ETH1_PMT\ wakeup\ Cid=1
RIF.RIFAWARE.EXTI1\ Feature\ ETH1_PMT\ wakeup\ CortexA35NSOS=true
RIF.RIFAWARE.EXTI1\ Feature\ ETH1_PMT\ wakeup\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ ETH2_PMT\ wakeup\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ ETH2_PMT\ wakeup\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[0]\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[0]\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[10]\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[10]\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[11]\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[11]\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[12]\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[12]\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[13]\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[13]\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[14]\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[14]\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[15]\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[15]\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[1]\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[1]\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[2]\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[2]\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[3]\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[3]\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[4]\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[4]\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[5]\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[5]\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[6]\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[6]\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[7]\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[7]\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[8]\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[8]\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[9]\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[9]\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ HPDMA1\ Channel\ 0\ to\ 15\ CPU1\ irq\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ HPDMA1\ Channel\ 0\ to\ 15\ CPU2\ irq\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ HPDMA2\ Channel\ 0\ to\ 15\ CPU1\ irq\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ HPDMA2\ Channel\ 0\ to\ 15\ CPU2\ irq\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ HPDMA3\ Channel\ 0\ to\ 15\ CPU1\ irq\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ HPDMA3\ Channel\ 0\ to\ 15\ CPU2\ irq\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ I2C1\ Cid=1
RIF.RIFAWARE.EXTI1\ Feature\ I2C1\ CortexA35NSOS=true
RIF.RIFAWARE.EXTI1\ Feature\ I2C1\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ I2C2\ Cid=1
RIF.RIFAWARE.EXTI1\ Feature\ I2C2\ CortexA35NSOS=true
RIF.RIFAWARE.EXTI1\ Feature\ I2C2\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ I2C3\ Cid=1
RIF.RIFAWARE.EXTI1\ Feature\ I2C3\ CortexA35NSOS=true
RIF.RIFAWARE.EXTI1\ Feature\ I2C3\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ I2C4\ Cid=1
RIF.RIFAWARE.EXTI1\ Feature\ I2C4\ CortexA35NSOS=true
RIF.RIFAWARE.EXTI1\ Feature\ I2C4\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ I2C5\ Cid=1
RIF.RIFAWARE.EXTI1\ Feature\ I2C5\ CortexA35NSOS=true
RIF.RIFAWARE.EXTI1\ Feature\ I2C5\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ I2C6\ Cid=1
RIF.RIFAWARE.EXTI1\ Feature\ I2C6\ CortexA35NSOS=true
RIF.RIFAWARE.EXTI1\ Feature\ I2C6\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ I2C7\ Cid=1
RIF.RIFAWARE.EXTI1\ Feature\ I2C7\ CortexA35NSOS=true
RIF.RIFAWARE.EXTI1\ Feature\ I2C7\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ I3C1\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ I3C1\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ I3C2\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ I3C2\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ I3C3\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ I3C3\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ IPCC1\ non\ secure\ interrupt\ CPU1\ Cid=1
RIF.RIFAWARE.EXTI1\ Feature\ IPCC1\ non\ secure\ interrupt\ CPU1\ CortexA35NSOS=true
RIF.RIFAWARE.EXTI1\ Feature\ IPCC1\ non\ secure\ interrupt\ CPU1\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ IPCC1\ non\ secure\ interrupt\ CPU2\ Cid=2
RIF.RIFAWARE.EXTI1\ Feature\ IPCC1\ non\ secure\ interrupt\ CPU2\ CortexM33NS=true
RIF.RIFAWARE.EXTI1\ Feature\ IPCC1\ non\ secure\ interrupt\ CPU2\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ IPCC1\ secure\ interrupt\ CPU1\ Cid=1
RIF.RIFAWARE.EXTI1\ Feature\ IPCC1\ secure\ interrupt\ CPU1\ CortexA35SSecureOS=true
RIF.RIFAWARE.EXTI1\ Feature\ IPCC1\ secure\ interrupt\ CPU1\ Secure=true
RIF.RIFAWARE.EXTI1\ Feature\ IPCC1\ secure\ interrupt\ CPU2\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ IPCC1\ secure\ interrupt\ CPU2\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ LPTIM1\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ LPTIM1\ Secure=false
