js216/stm32mp257_test_board/cubemx/mb.ioc
RIF.RIFAWARE.GPIO\ Feature\ PD1\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PD1\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PD10\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PD10\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PD10\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PD11\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PD11\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PD11\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PD12\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PD12\ CortexA35NSOS=false
RIF.RIFAWARE.GPIO\ Feature\ PD12\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PD13\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PD13\ CortexA35NSOS=false
RIF.RIFAWARE.GPIO\ Feature\ PD13\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PD14\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PD14\ CortexA35NSOS=false
RIF.RIFAWARE.GPIO\ Feature\ PD14\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PD15\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PD15\ CortexA35NSOS=false
RIF.RIFAWARE.GPIO\ Feature\ PD15\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PD2\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PD2\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PD2\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PD3\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PD3\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PD3\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PD4\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PD4\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PD4\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PD5\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PD5\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PD5\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PD6\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PD6\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PD6\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PD7\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PD7\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PD7\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PD8\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PD8\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PD9\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PD9\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PD9\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PE0\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PE0\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PE0\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PE1\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PE1\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PE1\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PE10\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PE10\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PE11\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PE11\ CortexA35NSOS=false
RIF.RIFAWARE.GPIO\ Feature\ PE11\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PE12\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PE12\ CortexA35NSOS=false
RIF.RIFAWARE.GPIO\ Feature\ PE12\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PE13\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PE13\ CortexA35NSOS=false
RIF.RIFAWARE.GPIO\ Feature\ PE13\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PE14\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PE14\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PE14\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PE15\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PE15\ CortexA35NSOS=false
RIF.RIFAWARE.GPIO\ Feature\ PE15\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PE2\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PE2\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PE2\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PE3\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PE3\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PE3\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PE4\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PE4\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PE4\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PE5\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PE5\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PE5\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PE6\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PE6\ CortexA35NSOS=false
RIF.RIFAWARE.GPIO\ Feature\ PE6\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PE7\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PE7\ CortexA35NSOS=false
RIF.RIFAWARE.GPIO\ Feature\ PE7\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PE8\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PE8\ CortexA35NSOS=false
RIF.RIFAWARE.GPIO\ Feature\ PE8\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PE9\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PE9\ CortexA35NSOS=false
RIF.RIFAWARE.GPIO\ Feature\ PE9\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PF0\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PF0\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PF0\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PF1\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PF1\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PF1\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PF10\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PF10\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PF11\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PF11\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PF11\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PF12\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PF12\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PF12\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PF13\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PF13\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PF13\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PF14\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PF14\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PF14\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PF15\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PF15\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PF2\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PF2\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PF3\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PF3\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PF4\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PF4\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PF4\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PF5\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PF5\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PF5\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PF6\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PF6\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PF7\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PF7\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PF7\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PF8\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PF8\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PF8\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PF9\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PF9\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PG0\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PG0\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PG0\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PG1\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PG1\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PG1\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PG10\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PG10\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PG10\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PG11\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PG11\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PG11\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PG12\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PG12\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PG12\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PG13\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PG13\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PG13\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PG14\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PG14\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PG14\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PG15\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PG15\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PG15\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PG2\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PG2\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PG2\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PG3\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PG3\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PG3\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PG4\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PG4\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PG5\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PG5\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PG5\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PG6\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PG6\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PG6\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PG7\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PG7\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PG7\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PG8\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PG8\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PG8\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PG9\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PG9\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PG9\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PH10\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PH10\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PH10\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PH11\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PH11\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PH11\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PH12\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PH12\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PH12\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PH13\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PH13\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PH13\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PH2\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PH2\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PH2\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PH3\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PH3\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PH4\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PH4\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PH5\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PH5\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PH6\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PH6\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PH7\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PH7\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PH7\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PH8\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PH8\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PH9\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PH9\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PH9\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PI0\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PI0\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PI1\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PI1\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PI1\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PI10\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PI10\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PI10\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PI11\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PI11\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PI11\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PI2\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PI2\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PI3\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PI3\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PI4\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PI4\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PI5\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PI5\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PI5\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PI6\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PI6\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PI6\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PI7\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PI7\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PI7\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PI8\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PI8\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PI9\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PI9\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PZ0\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PZ0\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PZ0\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PZ1\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PZ1\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PZ1\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PZ2\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PZ2\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PZ3\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PZ3\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PZ4\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PZ4\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PZ4\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PZ5\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PZ5\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PZ5\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PZ6\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PZ6\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PZ6\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PZ7\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PZ7\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PZ8\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PZ8\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PZ9\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PZ9\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PZ9\ Secure=false
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 0\ Cid=-
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 0\ Secure=false
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 1\ Cid=-
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 1\ Secure=false
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 10\ Cid=-
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 10\ Secure=false
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 11\ Cid=-
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 11\ Secure=false
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 12\ Cid=-
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 12\ Secure=false
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 13\ Cid=-
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 13\ Secure=false
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 14\ Cid=-
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 14\ Secure=false
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 15\ Cid=-
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 15\ Secure=false
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 2\ Cid=-
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 2\ Secure=false
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 3\ Cid=-
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 3\ Secure=false
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 4\ Cid=-
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 4\ Secure=false
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 5\ Cid=-
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 5\ Secure=false
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 6\ Cid=-
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 6\ Secure=false
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 7\ Cid=-
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 7\ Secure=false
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 8\ Cid=-
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 8\ Secure=false
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 9\ Cid=-
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 9\ Secure=false
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 0\ Cid=-
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 0\ Secure=false
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 1\ Cid=-
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 1\ Secure=false
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 10\ Cid=-
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 10\ Secure=false
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 11\ Cid=-
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 11\ Secure=false
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 12\ Cid=-
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 12\ Secure=false
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 13\ Cid=-
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 13\ Secure=false
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 14\ Cid=-
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 14\ Secure=false
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 15\ Cid=-
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 15\ Secure=false
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 2\ Cid=-
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 2\ Secure=false
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 3\ Cid=-
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 3\ Secure=false
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 4\ Cid=-
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 4\ Secure=false
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 5\ Cid=-
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 5\ Secure=false
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 6\ Cid=-
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 6\ Secure=false
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 7\ Cid=-
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 7\ Secure=false
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 8\ Cid=-
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 8\ Secure=false
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 9\ Cid=-
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 9\ Secure=false
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 0\ Cid=-
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 0\ Secure=false
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 1\ Cid=-
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 1\ Secure=false
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 10\ Cid=-
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 10\ Secure=false
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 11\ Cid=-
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 11\ Secure=false
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 12\ Cid=-
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 12\ Secure=false
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 13\ Cid=-
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 13\ Secure=false
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 14\ Cid=-
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 14\ Secure=false
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 15\ Cid=-
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 15\ Secure=false
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 2\ Cid=-
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 2\ Secure=false
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 3\ Cid=-
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 3\ Secure=false
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 4\ Cid=-
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 4\ Secure=false
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 5\ Cid=-
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 5\ Secure=false
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 6\ Cid=-
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 6\ Secure=false
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 7\ Cid=-
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 7\ Secure=false
