js216/stm32mp257_test_board/cubemx/mb.ioc
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 8\ Cid=-
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 8\ Secure=false
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 9\ Cid=-
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 9\ Secure=false
RIF.RIFAWARE.HSEM\ Feature\ Group\ 0\ Semaphore\ 0\ Cid=-
RIF.RIFAWARE.HSEM\ Feature\ Group\ 0\ Semaphore\ 0\ Secure=false
RIF.RIFAWARE.HSEM\ Feature\ Group\ 0\ Semaphore\ 1\ Cid=-
RIF.RIFAWARE.HSEM\ Feature\ Group\ 0\ Semaphore\ 1\ Secure=false
RIF.RIFAWARE.HSEM\ Feature\ Group\ 0\ Semaphore\ 2\ Cid=-
RIF.RIFAWARE.HSEM\ Feature\ Group\ 0\ Semaphore\ 2\ Secure=false
RIF.RIFAWARE.HSEM\ Feature\ Group\ 0\ Semaphore\ 3\ Cid=-
RIF.RIFAWARE.HSEM\ Feature\ Group\ 0\ Semaphore\ 3\ Secure=false
RIF.RIFAWARE.HSEM\ Feature\ Group\ 1\ Semaphore\ 4\ Cid=-
RIF.RIFAWARE.HSEM\ Feature\ Group\ 1\ Semaphore\ 4\ Secure=false
RIF.RIFAWARE.HSEM\ Feature\ Group\ 1\ Semaphore\ 5\ Cid=-
RIF.RIFAWARE.HSEM\ Feature\ Group\ 1\ Semaphore\ 5\ Secure=false
RIF.RIFAWARE.HSEM\ Feature\ Group\ 1\ Semaphore\ 6\ Cid=-
RIF.RIFAWARE.HSEM\ Feature\ Group\ 1\ Semaphore\ 6\ Secure=false
RIF.RIFAWARE.HSEM\ Feature\ Group\ 1\ Semaphore\ 7\ Cid=-
RIF.RIFAWARE.HSEM\ Feature\ Group\ 1\ Semaphore\ 7\ Secure=false
RIF.RIFAWARE.HSEM\ Feature\ Group\ 2\ Semaphore\ 10\ Cid=-
RIF.RIFAWARE.HSEM\ Feature\ Group\ 2\ Semaphore\ 10\ Secure=false
RIF.RIFAWARE.HSEM\ Feature\ Group\ 2\ Semaphore\ 11\ Cid=-
RIF.RIFAWARE.HSEM\ Feature\ Group\ 2\ Semaphore\ 11\ Secure=false
RIF.RIFAWARE.HSEM\ Feature\ Group\ 2\ Semaphore\ 8\ Cid=-
RIF.RIFAWARE.HSEM\ Feature\ Group\ 2\ Semaphore\ 8\ Secure=false
RIF.RIFAWARE.HSEM\ Feature\ Group\ 2\ Semaphore\ 9\ Cid=-
RIF.RIFAWARE.HSEM\ Feature\ Group\ 2\ Semaphore\ 9\ Secure=false
RIF.RIFAWARE.HSEM\ Feature\ Group\ 3\ Semaphore\ 12\ Cid=-
RIF.RIFAWARE.HSEM\ Feature\ Group\ 3\ Semaphore\ 12\ Secure=false
RIF.RIFAWARE.HSEM\ Feature\ Group\ 3\ Semaphore\ 13\ Cid=-
RIF.RIFAWARE.HSEM\ Feature\ Group\ 3\ Semaphore\ 13\ Secure=false
RIF.RIFAWARE.HSEM\ Feature\ Group\ 3\ Semaphore\ 14\ Cid=-
RIF.RIFAWARE.HSEM\ Feature\ Group\ 3\ Semaphore\ 14\ Secure=false
RIF.RIFAWARE.HSEM\ Feature\ Group\ 3\ Semaphore\ 15\ Cid=-
RIF.RIFAWARE.HSEM\ Feature\ Group\ 3\ Semaphore\ 15\ Secure=false
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 1\ Cid=-
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 1\ Secure=false
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 10\ Cid=-
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 10\ Secure=false
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 11\ Cid=-
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 11\ Secure=false
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 12\ Cid=-
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 12\ Secure=false
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 13\ Cid=-
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 13\ Secure=false
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 14\ Cid=-
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 14\ Secure=false
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 15\ Cid=-
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 15\ Secure=false
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 16\ Cid=-
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 16\ Secure=false
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 2\ Cid=-
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 2\ Secure=false
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 3\ Cid=-
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 3\ Secure=false
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 4\ Cid=-
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 4\ Secure=false
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 5\ Cid=-
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 5\ Secure=false
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 6\ Cid=-
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 6\ Secure=false
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 7\ Cid=-
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 7\ Secure=false
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 8\ Cid=-
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 8\ Secure=false
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 9\ Cid=-
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 9\ Secure=false
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 1\ Cid=-
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 1\ Secure=false
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 10\ Cid=-
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 10\ Secure=false
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 11\ Cid=-
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 11\ Secure=false
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 12\ Cid=-
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 12\ Secure=false
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 13\ Cid=-
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 13\ Secure=false
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 14\ Cid=-
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 14\ Secure=false
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 15\ Cid=-
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 15\ Secure=false
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 16\ Cid=-
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 16\ Secure=false
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 2\ Cid=-
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 2\ Secure=false
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 3\ Cid=-
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 3\ Secure=false
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 4\ Cid=-
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 4\ Secure=false
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 5\ Cid=-
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 5\ Secure=false
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 6\ Cid=-
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 6\ Secure=false
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 7\ Cid=-
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 7\ Secure=false
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 8\ Cid=-
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 8\ Secure=false
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 9\ Cid=-
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 9\ Secure=false
RIF.RIFAWARE.LTDC\ Feature\ LTDC_CMN\ Cid=1
RIF.RIFAWARE.LTDC\ Feature\ LTDC_CMN\ CortexA35NSOS=true
RIF.RIFAWARE.LTDC\ Feature\ LTDC_CMN\ CortexA35NSSSBL=true
RIF.RIFAWARE.LTDC\ Feature\ LTDC_CMN\ Secure=false
RIF.RIFAWARE.LTDC\ Feature\ LTDC_L1L2\ Cid=1
RIF.RIFAWARE.LTDC\ Feature\ LTDC_L1L2\ CortexA35NSOS=true
RIF.RIFAWARE.LTDC\ Feature\ LTDC_L1L2\ CortexA35NSSSBL=true
RIF.RIFAWARE.LTDC\ Feature\ LTDC_L1L2\ Secure=false
RIF.RIFAWARE.LTDC\ Feature\ LTDC_L3\ Cid=1
RIF.RIFAWARE.LTDC\ Feature\ LTDC_L3\ CortexA35SSecureOS=true
RIF.RIFAWARE.LTDC\ Feature\ LTDC_L3\ Secure=true
RIF.RIFAWARE.LTDC\ Feature\ LTDC_ROT\ Cid=1
RIF.RIFAWARE.LTDC\ Feature\ LTDC_ROT\ CortexA35NSOS=true
RIF.RIFAWARE.LTDC\ Feature\ LTDC_ROT\ CortexA35NSSSBL=true
RIF.RIFAWARE.LTDC\ Feature\ LTDC_ROT\ Secure=false
RIF.RIFAWARE.PWR\ Feature\ CPU1\ power\ control\ BootROMA35=true
RIF.RIFAWARE.PWR\ Feature\ CPU1\ power\ control\ Cid=1
RIF.RIFAWARE.PWR\ Feature\ CPU1\ power\ control\ Secure=true
RIF.RIFAWARE.PWR\ Feature\ CPU2\ power\ control\ Cid=-
RIF.RIFAWARE.PWR\ Feature\ CPU2\ power\ control\ Secure=false
RIF.RIFAWARE.PWR\ Feature\ CPU3\ power\ control\ Cid=-
RIF.RIFAWARE.PWR\ Feature\ CPU3\ power\ control\ Secure=false
RIF.RIFAWARE.PWR\ Feature\ RAM\ and\ low\ power\ Cid=-
RIF.RIFAWARE.PWR\ Feature\ RAM\ and\ low\ power\ Secure=false
RIF.RIFAWARE.PWR\ Feature\ VDD\ SD\ Cid=-
RIF.RIFAWARE.PWR\ Feature\ VDD\ SD\ Secure=false
RIF.RIFAWARE.PWR\ Feature\ VDD\ eMMC\ Cid=-
RIF.RIFAWARE.PWR\ Feature\ VDD\ eMMC\ Secure=false
RIF.RIFAWARE.PWR\ Feature\ Voltage\ monitoring\ Cid=-
RIF.RIFAWARE.PWR\ Feature\ Voltage\ monitoring\ Secure=false
RIF.RIFAWARE.PWR\ Feature\ Wake\ up\ 1\ Cid=-
RIF.RIFAWARE.PWR\ Feature\ Wake\ up\ 1\ Secure=false
RIF.RIFAWARE.PWR\ Feature\ Wake\ up\ 2\ Cid=-
RIF.RIFAWARE.PWR\ Feature\ Wake\ up\ 2\ Secure=false
RIF.RIFAWARE.PWR\ Feature\ Wake\ up\ 3\ Cid=-
RIF.RIFAWARE.PWR\ Feature\ Wake\ up\ 3\ Secure=false
RIF.RIFAWARE.PWR\ Feature\ Wake\ up\ 4\ Cid=-
RIF.RIFAWARE.PWR\ Feature\ Wake\ up\ 4\ Secure=false
RIF.RIFAWARE.PWR\ Feature\ Wake\ up\ 5\ Cid=-
RIF.RIFAWARE.PWR\ Feature\ Wake\ up\ 5\ Secure=false
RIF.RIFAWARE.PWR\ Feature\ Wake\ up\ 6\ Cid=-
RIF.RIFAWARE.PWR\ Feature\ Wake\ up\ 6\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ BKPSRAM_CFGR\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ BKPSRAM_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ BOOT_STDB\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ BOOT_STDB\ CortexA35SFSBLA=true
RIF.RIFAWARE.RCC\ Feature\ BOOT_STDB\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ BOOT_STDB\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ BSEC_CFGR\ BootROMA35=true
RIF.RIFAWARE.RCC\ Feature\ BSEC_CFGR\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ BSEC_CFGR\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_CPU1_EXT2F\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_CPU1_EXT2F\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_CPU1_EXT2F\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_ICN_DDR\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_ICN_DDR\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_ICN_DDR\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_ICN_DISPLAY\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_ICN_DISPLAY\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_ICN_DISPLAY\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_ICN_HSL\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_ICN_HSL\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_ICN_HSL\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_ICN_HS_MCU\\nCK_ICN_LS_MCU\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_ICN_HS_MCU\\nCK_ICN_LS_MCU\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_ICN_HS_MCU\\nCK_ICN_LS_MCU\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_ICN_M_GPU\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_ICN_M_GPU\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_ICN_M_GPU\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_ICN_NIC\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_ICN_NIC\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_ICN_NIC\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_ICN_SDMMC\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_ICN_SDMMC\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_ICN_SDMMC\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_ICN_VID\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_ICN_VID\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_ICN_VID\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_ADC12\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_KER_ADC12\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_ADC12\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_ADC3\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ CK_KER_ADC3\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ CK_KER_ADF1\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ CK_KER_ADF1\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ CK_KER_CSIPHY\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ CK_KER_CSIPHY\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ CK_KER_CSITXESC\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ CK_KER_CSITXESC\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ CK_KER_DCMIPP\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ CK_KER_DCMIPP\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ CK_KER_DSIPHY\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ CK_KER_DSIPHY\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ CK_KER_ETH1PTP\\nCK_KER_ETH2PTP\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_KER_ETH1PTP\\nCK_KER_ETH2PTP\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_ETH1PTP\\nCK_KER_ETH2PTP\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_ETH1\\nCK_KER_ETHSW\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_KER_ETH1\\nCK_KER_ETHSW\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_ETH1\\nCK_KER_ETHSW\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_ETH2\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ CK_KER_ETH2\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ CK_KER_ETHSWREF\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_KER_ETHSWREF\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_ETHSWREF\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_FDCAN\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ CK_KER_FDCAN\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ CK_KER_FMC\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_KER_FMC\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_FMC\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_I2C1,2\\nCK_KER_I3C1,2\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_KER_I2C1,2\\nCK_KER_I3C1,2\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_I2C1,2\\nCK_KER_I3C1,2\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_I2C3,5\\nCK_KER_I3C3\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_KER_I2C3,5\\nCK_KER_I3C3\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_I2C3,5\\nCK_KER_I3C3\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_I2C4,6\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_KER_I2C4,6\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_I2C4,6\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_I2C7\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_KER_I2C7\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_I2C7\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_I2C8\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_KER_I2C8\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_I2C8\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_I3C4\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ CK_KER_I3C4\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ CK_KER_LPTIM1,2\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ CK_KER_LPTIM1,2\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ CK_KER_LPTIM3\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ CK_KER_LPTIM3\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ CK_KER_LPTIM4,5\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ CK_KER_LPTIM4,5\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ CK_KER_LPUART1\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ CK_KER_LPUART1\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ CK_KER_LTDC\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ CK_KER_LTDC\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ CK_KER_LVDSPHY\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_KER_LVDSPHY\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_LVDSPHY\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_OSPI1\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ CK_KER_OSPI1\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ CK_KER_OSPI2\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ CK_KER_OSPI2\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ CK_KER_SAI1\\nCK_KER_MDF1\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ CK_KER_SAI1\\nCK_KER_MDF1\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ CK_KER_SAI2\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ CK_KER_SAI2\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ CK_KER_SAI3,4\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ CK_KER_SAI3,4\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ CK_KER_SDMMC1\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_KER_SDMMC1\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_SDMMC1\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_SDMMC2\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ CK_KER_SDMMC2\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ CK_KER_SDMMC3\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ CK_KER_SDMMC3\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ CK_KER_SPDIFRX\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ CK_KER_SPDIFRX\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ CK_KER_SPI1\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_KER_SPI1\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_SPI1\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_SPI2,3\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_KER_SPI2,3\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_SPI2,3\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_SPI4,5\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_KER_SPI4,5\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_SPI4,5\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_SPI6,7\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_KER_SPI6,7\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_SPI6,7\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_SPI8\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_KER_SPI8\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_SPI8\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_STGEN\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_KER_STGEN\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_STGEN\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_TPIU\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_KER_TPIU\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_TPIU\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_TSDBG\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_KER_TSDBG\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_TSDBG\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_UART7,8\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_KER_UART7,8\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_UART7,8\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_UART9\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_KER_UART9\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_UART9\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_USART1\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_KER_USART1\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_USART1\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_USART2,4\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_KER_USART2,4\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_USART2,4\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_USART3,5\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_KER_USART3,5\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_USART3,5\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_USART6\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_KER_USART6\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_USART6\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_USB2PHY1\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_KER_USB2PHY1\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_USB2PHY1\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_USB2PHY2\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_KER_USB2PHY2\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_USB2PHY2\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_USB3PCIEPHY\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_KER_USB3PCIEPHY\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_USB3PCIEPHY\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_USBTC\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_KER_USBTC\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_USBTC\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_MCO1\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ CK_MCO1\ Secure=false
