js216/stm32mp257_test_board/cubemx/mb.ioc
RIF.RIFAWARE.RCC\ Feature\ CK_MCO2\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ CK_MCO2\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ CK_SYS_ATB\\nCK_ICN_M_ETR\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_SYS_ATB\\nCK_ICN_M_ETR\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_SYS_ATB\\nCK_ICN_M_ETR\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_SYS_PLL4,5,6,7,8\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_SYS_PLL4,5,6,7,8\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_SYS_PLL4,5,6,7,8\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CPU1_RES\ BootROMA35=true
RIF.RIFAWARE.RCC\ Feature\ CPU1_RES\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CPU1_RES\ CortexA35SFSBLA=true
RIF.RIFAWARE.RCC\ Feature\ CPU1_RES\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CPU1_RES\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CPU2_RES\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ CPU2_RES\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ CPU3_RES\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ CPU3_RES\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ DDRC_CFGR\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ DDRC_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ DEBUG_CFGR\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ DEBUG_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ FCALC\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ FCALC\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ FMC_CFGR\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ FMC_CFGR\ CortexA35NSOS=false
RIF.RIFAWARE.RCC\ Feature\ FMC_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ GPIOA_CFGR\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ GPIOA_CFGR\ CortexA35NSOS=true
RIF.RIFAWARE.RCC\ Feature\ GPIOA_CFGR\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ GPIOB_CFGR\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ GPIOB_CFGR\ CortexA35NSOS=true
RIF.RIFAWARE.RCC\ Feature\ GPIOB_CFGR\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ GPIOC_CFGR\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ GPIOC_CFGR\ CortexA35NSOS=true
RIF.RIFAWARE.RCC\ Feature\ GPIOC_CFGR\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ GPIOD_CFGR\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ GPIOD_CFGR\ CortexA35NSOS=true
RIF.RIFAWARE.RCC\ Feature\ GPIOD_CFGR\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ GPIOE_CFGR\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ GPIOE_CFGR\ CortexA35NSOS=true
RIF.RIFAWARE.RCC\ Feature\ GPIOE_CFGR\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ GPIOF_CFGR\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ GPIOF_CFGR\ CortexA35NSOS=true
RIF.RIFAWARE.RCC\ Feature\ GPIOF_CFGR\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ GPIOG_CFGR\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ GPIOG_CFGR\ CortexA35NSOS=true
RIF.RIFAWARE.RCC\ Feature\ GPIOG_CFGR\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ GPIOH_CFGR\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ GPIOH_CFGR\ CortexA35NSOS=true
RIF.RIFAWARE.RCC\ Feature\ GPIOH_CFGR\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ GPIOI_CFGR\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ GPIOI_CFGR\ CortexA35NSOS=true
RIF.RIFAWARE.RCC\ Feature\ GPIOI_CFGR\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ GPIOJ_CFGR\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ GPIOJ_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ GPIOK_CFGR\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ GPIOK_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ GPIOZ_CFGR\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ GPIOZ_CFGR\ CortexA35NSOS=true
RIF.RIFAWARE.RCC\ Feature\ GPIOZ_CFGR\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ HPDMA1_CFGR\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ HPDMA1_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ HPDMA2_CFGR\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ HPDMA2_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ HPDMA3_CFGR\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ HPDMA3_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ HSEM_CFGR\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ HSEM_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ HSI_MON\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ HSI_MON\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ IPCC1_CFGR\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ IPCC1_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ IPCC2_CFGR\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ IPCC2_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ LPDMA_CFGR\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ LPDMA_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ LPSRAM1_CFGR\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ LPSRAM1_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ LPSRAM2_CFGR\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ LPSRAM2_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ LPSRAM3_CFGR\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ LPSRAM3_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ MCO1_CFGR\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ MCO1_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ MCO2_CFGR\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ MCO2_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ OSPI1_CFGR\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ OSPI1_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ OSPI2_CFGR\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ OSPI2_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ PLL3_CFGR\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ PLL3_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ RDCR\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ RDCR\ CortexA35SFSBLA=true
RIF.RIFAWARE.RCC\ Feature\ RDCR\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ RDCR\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ RETRAM_CFGR\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ RETRAM_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ RTC_CFGR\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ RTC_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ SRAM1_CFGR\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ SRAM1_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ SRAM2_CFGR\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ SRAM2_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ SYSCLK\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ SYSCLK\ CortexA35SFSBLA=true
RIF.RIFAWARE.RCC\ Feature\ SYSCLK\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ SYSCLK\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ SYSCPU1_CFGR\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ SYSCPU1_CFGR\ CortexA35SFSBLA=true
RIF.RIFAWARE.RCC\ Feature\ SYSCPU1_CFGR\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ SYSCPU1_CFGR\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ SYSRAM_CFGR\ BootROMA35=true
RIF.RIFAWARE.RCC\ Feature\ SYSRAM_CFGR\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ SYSRAM_CFGR\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ SYSRST\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ SYSRST\ CortexA35SFSBLA=true
RIF.RIFAWARE.RCC\ Feature\ SYSRST\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ SYSRST\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ VDERAM_CFGR\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ VDERAM_CFGR\ Secure=false
RIF.RIFAWARE.RTC\ Feature\ Alarm\ A\ Cid=-
RIF.RIFAWARE.RTC\ Feature\ Alarm\ A\ Secure=false
RIF.RIFAWARE.RTC\ Feature\ Alarm\ B\ Cid=-
RIF.RIFAWARE.RTC\ Feature\ Alarm\ B\ Secure=false
RIF.RIFAWARE.RTC\ Feature\ Calibration\ Cid=-
RIF.RIFAWARE.RTC\ Feature\ Calibration\ Secure=false
RIF.RIFAWARE.RTC\ Feature\ Initialization\ Cid=-
RIF.RIFAWARE.RTC\ Feature\ Initialization\ Secure=false
RIF.RIFAWARE.RTC\ Feature\ Timestamp\ Cid=-
RIF.RIFAWARE.RTC\ Feature\ Timestamp\ Secure=false
RIF.RIFAWARE.RTC\ Feature\ Wakeup\ timer\ Cid=-
RIF.RIFAWARE.RTC\ Feature\ Wakeup\ timer\ Secure=false
RIF.RIFAWARE.TAMP\ End\ Address=1174471424
RIF.RIFAWARE.TAMP\ Feature\ Resource\ 0\ Cid=-
RIF.RIFAWARE.TAMP\ Feature\ Resource\ 0\ Secure=false
RIF.RIFAWARE.TAMP\ Feature\ Resource\ 1\ BootROMA35=true
RIF.RIFAWARE.TAMP\ Feature\ Resource\ 1\ Cid=1
RIF.RIFAWARE.TAMP\ Feature\ Resource\ 1\ CortexA35SFSBLA=true
RIF.RIFAWARE.TAMP\ Feature\ Resource\ 1\ CortexA35SSecureOS=true
RIF.RIFAWARE.TAMP\ Feature\ Resource\ 1\ Secure=true
RIF.RIFAWARE.TAMP\ Feature\ Resource\ 2\ Cid=-
RIF.RIFAWARE.TAMP\ Feature\ Resource\ 2\ Secure=false
RIF.RIFAWARE.TAMP\ Size=512
RIF.RIFAWARE.TAMP\ Start\ Address=1174470912
RIF.RIFAWARE.Zone1-RIF1\ End\ Address=1174471424
RIF.RIFAWARE.Zone1-RIF1\ Size=512
RIF.RIFAWARE.Zone1-RIF1\ Start\ Address=1174470912
RIF.RIFAWARE.Zone1-RIF2\ End\ Address=1174471424
RIF.RIFAWARE.Zone1-RIF2\ Size=0
RIF.RIFAWARE.Zone1-RIF2\ Start\ Address=1174471424
RIF.RIFAWARE.Zone2-RIF1\ End\ Address=1174471424
RIF.RIFAWARE.Zone2-RIF1\ Size=0
RIF.RIFAWARE.Zone2-RIF1\ Start\ Address=1174471424
RIF.RIFAWARE.Zone2-RIF2\ End\ Address=1174471424
RIF.RIFAWARE.Zone2-RIF2\ Size=0
RIF.RIFAWARE.Zone2-RIF2\ Start\ Address=1174471424
RIF.RIFAWARE.Zone3-RIF0\ End\ Address=1174471424
RIF.RIFAWARE.Zone3-RIF0\ Size=0
RIF.RIFAWARE.Zone3-RIF0\ Start\ Address=1174471424
RIF.RIFAWARE.Zone3-RIF1\ End\ Address=1174471424
RIF.RIFAWARE.Zone3-RIF1\ Size=0
RIF.RIFAWARE.Zone3-RIF1\ Start\ Address=1174471424
RIF.RIFAWARE.Zone3-RIF2\ End\ Address=1174471424
RIF.RIFAWARE.Zone3-RIF2\ Size=0
RIF.RIFAWARE.Zone3-RIF2\ Start\ Address=1174471424
RIF.RISUP.IWDG5.Lock=true
RIF.RISUP.RAMCFG.Privilege=true
RIF.SDMMC1_CID_RIMU=1
RIF.USB3DR_CID_RIMU=1
RIF.USBH_CID_RIMU=1
RIF.default_config=true
SH.FMC_A16_CLE.0=FMC_CLE,8b-dmux1
SH.FMC_A16_CLE.ConfNb=1
SH.FMC_A17_ALE.0=FMC_ALE,8b-dmux1
SH.FMC_A17_ALE.ConfNb=1
SH.FMC_D0_DA0.0=FMC_D0,8b-dmux1
SH.FMC_D0_DA0.ConfNb=1
SH.FMC_D1_DA1.0=FMC_D1,8b-dmux1
SH.FMC_D1_DA1.ConfNb=1
SH.FMC_D2_DA2.0=FMC_D2,8b-dmux1
SH.FMC_D2_DA2.ConfNb=1
SH.FMC_D3_DA3.0=FMC_D3,8b-dmux1
SH.FMC_D3_DA3.ConfNb=1
SH.FMC_D4_DA4.0=FMC_D4,8b-dmux1
SH.FMC_D4_DA4.ConfNb=1
SH.FMC_D5_DA5.0=FMC_D5,8b-dmux1
SH.FMC_D5_DA5.ConfNb=1
SH.FMC_D6_DA6.0=FMC_D6,8b-dmux1
SH.FMC_D6_DA6.ConfNb=1
SH.FMC_D7_DA7.0=FMC_D7,8b-dmux1
SH.FMC_D7_DA7.ConfNb=1
SH.FMC_NOE.0=FMC_NOE,8b-dmux1
SH.FMC_NOE.ConfNb=1
SH.FMC_NWE.0=FMC_NWE,8b-dmux1
SH.FMC_NWE.ConfNb=1
SPI1.CalculateBaudRate=32.0 MBits/s
SPI1.Direction=SPI_DIRECTION_2LINES
SPI1.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate,VirtualNSS
SPI1.Mode=SPI_MODE_MASTER
SPI1.VirtualNSS=VM_NSSHARD
SPI1.VirtualType=VM_MASTER
SPI2.CalculateBaudRate=32.0 MBits/s
SPI2.Direction=SPI_DIRECTION_2LINES
SPI2.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate,VirtualNSS
SPI2.Mode=SPI_MODE_MASTER
SPI2.VirtualNSS=VM_NSSHARD
SPI2.VirtualType=VM_MASTER
SPI3.CalculateBaudRate=32.0 MBits/s
SPI3.Direction=SPI_DIRECTION_2LINES
SPI3.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate,VirtualNSS
SPI3.Mode=SPI_MODE_MASTER
SPI3.VirtualNSS=VM_NSSHARD
SPI3.VirtualType=VM_MASTER
SPI4.CalculateBaudRate=32.0 MBits/s
SPI4.Direction=SPI_DIRECTION_2LINES
SPI4.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate,VirtualNSS
SPI4.Mode=SPI_MODE_MASTER
SPI4.VirtualNSS=VM_NSSHARD
SPI4.VirtualType=VM_MASTER
SPI5.CalculateBaudRate=32.0 MBits/s
SPI5.Direction=SPI_DIRECTION_2LINES
SPI5.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate,VirtualNSS
SPI5.Mode=SPI_MODE_MASTER
SPI5.VirtualNSS=VM_NSSHARD
SPI5.VirtualType=VM_MASTER
SPI6.CalculateBaudRate=32.0 MBits/s
SPI6.Direction=SPI_DIRECTION_2LINES
SPI6.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate,VirtualNSS
SPI6.Mode=SPI_MODE_MASTER
SPI6.VirtualNSS=VM_NSSHARD
SPI6.VirtualType=VM_MASTER
SPI7.CalculateBaudRate=32.0 MBits/s
SPI7.Direction=SPI_DIRECTION_2LINES
SPI7.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate,VirtualNSS
SPI7.Mode=SPI_MODE_MASTER
SPI7.VirtualNSS=VM_NSSHARD
SPI7.VirtualType=VM_MASTER
SPI8.CalculateBaudRate=32.0 MBits/s
SPI8.Direction=SPI_DIRECTION_2LINES
SPI8.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate,VirtualNSS
SPI8.Mode=SPI_MODE_MASTER
SPI8.VirtualNSS=VM_NSSHARD
SPI8.VirtualType=VM_MASTER
UCPD1_CC1.GPIOParameters=PinAttribute
UCPD1_CC1.Mode=Dual_Role_AllSignals
UCPD1_CC1.PinAttribute=CortexA35NSOS
UCPD1_CC1.Signal=UCPD1_CC1
UCPD1_CC2.GPIOParameters=PinAttribute
UCPD1_CC2.Mode=Dual_Role_AllSignals
UCPD1_CC2.PinAttribute=CortexA35NSOS
UCPD1_CC2.Signal=UCPD1_CC2
USART1.IPParameters=VirtualMode-Asynchronous
USART1.VirtualMode-Asynchronous=VM_ASYNC
USART2.IPParameters=VirtualMode-Asynchronous
USART2.VirtualMode-Asynchronous=VM_ASYNC
USART3.IPParameters=VirtualMode-Asynchronous
USART3.VirtualMode-Asynchronous=VM_ASYNC
USART6.IPParameters=VirtualMode-Asynchronous
USART6.VirtualMode-Asynchronous=VM_ASYNC
USB3DR_DM.GPIOParameters=PinAttribute
USB3DR_DM.Mode=Dual_Role_mode_USB3
USB3DR_DM.PinAttribute=CortexA35NSOS
USB3DR_DM.Signal=USB3DR_DM
USB3DR_DP.GPIOParameters=PinAttribute
USB3DR_DP.Mode=Dual_Role_mode_USB3
USB3DR_DP.PinAttribute=CortexA35NSOS
USB3DR_DP.Signal=USB3DR_DP
USB3DR_TXRTUNE.GPIOParameters=PinAttribute
USB3DR_TXRTUNE.Mode=Dual_Role_mode_USB3
USB3DR_TXRTUNE.PinAttribute=CortexA35NSOS
USB3DR_TXRTUNE.Signal=USB3DR_TXRTUNE
USBH_HS_DM.GPIOParameters=PinAttribute
USBH_HS_DM.Mode=Enable
USBH_HS_DM.PinAttribute=CortexA35NSOS
USBH_HS_DM.Signal=USBH_HS_DM
USBH_HS_DP.GPIOParameters=PinAttribute
USBH_HS_DP.Mode=Enable
USBH_HS_DP.PinAttribute=CortexA35NSOS
USBH_HS_DP.Signal=USBH_HS_DP
USBH_HS_TXRTUNE.GPIOParameters=PinAttribute
USBH_HS_TXRTUNE.Mode=Enable
USBH_HS_TXRTUNE.PinAttribute=CortexA35NSOS
USBH_HS_TXRTUNE.Signal=USBH_HS_TXRTUNE
VP_BSEC_VS_BSEC.Mode=BSEC_Activate
VP_BSEC_VS_BSEC.Signal=BSEC_VS_BSEC
VP_CORTEX_M33_VS_CORTEX_M33.Mode=CORTEX_M33_Activate
VP_CORTEX_M33_VS_CORTEX_M33.Signal=CORTEX_M33_VS_CORTEX_M33
VP_DDR_CTRL_PHY_LPDDR4.Mode=LPDDR4
VP_DDR_CTRL_PHY_LPDDR4.Signal=DDR_CTRL_PHY_LPDDR4
VP_DDR_CTRL_PHY_VS_2Gb.Mode=2Gb
VP_DDR_CTRL_PHY_VS_2Gb.Signal=DDR_CTRL_PHY_VS_2Gb
VP_DDR_CTRL_PHY_VS_32BITS.Mode=32bits
VP_DDR_CTRL_PHY_VS_32BITS.Signal=DDR_CTRL_PHY_VS_32BITS
VP_GPU_VS_GPU.Mode=GPU_Activate
VP_GPU_VS_GPU.Signal=GPU_VS_GPU
VP_RIF_VS_RIF1.Mode=RISUP
VP_RIF_VS_RIF1.Signal=RIF_VS_RIF1
VP_STGEN_VS_STGEN.Mode=STGEN_Activate
VP_STGEN_VS_STGEN.Signal=STGEN_VS_STGEN
VP_SYS_VS_Systick.Mode=SysTick
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
board=custom
